Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotTemporaryDrawPolyLine_t
DO NOT USE! For internal usage only!

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotTemporaryDrawPolyLine_t.nPoints
The number of points, should equal the number of points set to Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotTemporaryDrawPolyLine_t.aPoints.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotTemporaryDrawPolyLine_t.aPoints
The array of points.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotTemporaryDrawPolyLine_t.Color
The color of the line.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotTemporaryDrawPolyLine_t.Id
The identifier of the line.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotTemporaryDrawPolyLine_t.SubId
The sub-identifier of the line.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotTemporaryDrawPolyLine_t.ViewId
The view identifier.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotTemporaryDrawPolyLine_t.LineWidth
The width of the line.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotTemporaryDrawPolyLine_t.LineType
The type of the line.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotTemporaryDrawPolyLine_t.DrawToFrontBuffer
Indicates whether the line should be drawn on top of everything else.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotTemporaryDrawPolyLine_t.IsSnappable
Indicates whether the graphic can be snapped to.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotTemporaryDrawPolyLine_t.DrawLightingEffect
Indicates whether the graphic has lighting effect.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotTemporaryDrawPolyLine_t.UseSecondaryColor
Indicates whether to use the secondary color.